{
  "sessions": [
    {
      "id": "2d8010f1-62cc-4540-82c2-e5e9a0f57804",
      "title": "Check-In & Registration",
      "description": null,
      "start": "2023-04-27T08:00:00",
      "end": "2023-04-27T09:15:00",
      "speakerIds": [],
      "roomId": "31079"
    },
    {
      "id": "461143",
      "title": "Android Graphics: the Path to [UI] Riches",
      "description": "Android's graphics APIs are extensive and powerful... but maybe a little complicated. This session will show ways to use the graphics APIs to achieve cool effects and improve the visual quality and richness of your applications.",
      "start": "2023-04-27T09:15:00",
      "end": "2023-04-27T10:00:00",
      "speakerIds": [
        "05fa719f-1528-43ef-adf9-eca92f383262",
        "152f613f-841b-407d-9a65-3703ec2dfae2"
      ],
      "roomId": "31079"
    },
    {
      "id": "cbfbf549-ac89-419a-9c13-506e09bb354a",
      "title": "Break",
      "description": null,
      "start": "2023-04-27T10:00:00",
      "end": "2023-04-27T10:30:00",
      "speakerIds": [],
      "roomId": "31079"
    },
    {
      "id": "433220",
      "title": "Using Compose Runtime to create a client library",
      "description": "Jetpack Compose (UI) is a powerful UI toolkit for Android. Have you ever wondered where this power comes from? The answer is Compose Runtime. \r\n\r\nIn this talk, we will see how we can use Compose Runtime to create client libraries. Firstly, we will talk about Compose nodes, Composition, Recomposer, and how they are orchestrated to create a slot table. Then, we will see how the changes in the slot table are applied with an Applier. Moreover, we will touch upon the Snapshot system and how the changes in the state objects trigger a recomposition. Finally, we will create a basic UI toolkit for PowerPoint using Compose Runtime.",
      "start": "2023-04-27T10:30:00",
      "end": "2023-04-27T11:15:00",
      "speakerIds": [
        "5f7faf69-dd61-4ad6-b6d8-0173cae292d8"
      ],
      "roomId": "31079"
    },
    {
      "id": "457041",
      "title": "En quête de perf: l'art subtile du profiling Android",
      "description": "Comment enquêter sur un problème de performance? Google a publié de nombreux outils d'investigation très puissants, mais aussi très intimidant. La première fois que j'ai ouvert Perfetto, j'ai  rigolé puis refermé la page immédiatement.\r\n\r\n Par ou commencer? Quel signaux faut t'il regarder, quand, et quelle conclusion en tirer? Comment choisir le bon outil de profiling adapté à une situation?\r\n\r\nCette session vous présente une approche systématique et concrète pour analyzer des problèmes de performance d'applications Android, en utilisant les bons outils de profiling dans le bon ordre.",
      "start": "2023-04-27T10:30:00",
      "end": "2023-04-27T11:15:00",
      "speakerIds": [
        "a733fc42-dcb9-4107-9675-70335f2889e9"
      ],
      "roomId": "31080"
    },
    {
      "id": "432816",
      "title": "Demystifying the test pyramid",
      "description": "Back in 2010, Mike Cohn in his \"Succeeding with Agile\" book, introduced the pyramid of tests. Since then, it has been criticized (mostly for being unsuitable for many real life situations), slightly updated, but its core concept is still seen in many articles. So what value can we get out of the test pyramid, and how can you adapt it to better fit with your use cases, workflows and setup.\r\n\r\nAfter explaining the original concept of the testing pyramid, we will discuss its pitfalls and caveats, then provide more depth and a new perspective on this tool while providing tips and guidelines that engineers can use to improve their test suites. \r\n",
      "start": "2023-04-27T10:30:00",
      "end": "2023-04-27T11:15:00",
      "speakerIds": [
        "bf58d77f-fad3-49b7-a6b3-82b5f46e5549"
      ],
      "roomId": "31081"
    },
    {
      "id": "454563",
      "title": "Developing system apps without AOSP",
      "description": "If you work with Android development long enough, there is a high chance that you eventually will be developing system applications for a custom Android device. This is quite different from doing regular apps we publish on Google Play Store, and used to require that you have the entire AOSP source code checked out in order to work with it. \r\n\r\nHowever, with some understanding of how Android internals work and how to use some undocumented features of the regular build tools, we can actually develop system apps without the whole mess that comes with AOSP.\r\n\r\nIn this session you'll learn how to use system and signature level permissions, how to efficiently call system APIs, and how to test all of this on a regular Android emulator. Hopefully this will make the daily life easier for all the Android developers working on system applications.",
      "start": "2023-04-27T10:30:00",
      "end": "2023-04-27T11:15:00",
      "speakerIds": [
        "79823093-1b16-4a2b-b0a9-ea4cd25b92f5"
      ],
      "roomId": "33634"
    },
    {
      "id": "456474",
      "title": "Help! What is my place in the IC vs. EM career path?",
      "description": "I will take you on a journey of the different career evolution opportunities that I had on my professional experience, be it on an Agency or with a client: developer, Lead Dev, Tech Lead, Scrum Master, Point of Contact, Team Leader, Developer Advocate, Core Team, Lead Chapter, Senior Staff Engineer... Behind all those titles (that I had in a official or non-official way), I could see an evolution on the company's organizations that are looking more and more add value to technical careers and develop a tech culture. Moreover, the definitions and expectations can vary from one company to another. One trend is clear: one path is oriented on technical expertise (Individual Contributor) and another is oriented on people management (Engineering Management), but... how to proceed if we want to do a little bit of both? I may have found the answer and I will explain to you on this talk!",
      "start": "2023-04-27T11:25:00",
      "end": "2023-04-27T11:45:00",
      "speakerIds": [
        "7c888e22-f254-4e04-aa56-1853ab18c000"
      ],
      "roomId": "31079"
    },
    {
      "id": "455615",
      "title": "Clean Code Base: Harnessing the Power of Android Lint and Custom Rules",
      "description": "As Android developers, we all know the importance of writing clean and maintainable code. However, as our codebase grows, it becomes increasingly difficult to ensure that all developers are following the same coding standards. That's where Android Lint comes in.\r\n\r\nAndroid Lint is a powerful tool that can help us catch a wide range of potential issues in our codebase. Lint can save us hours of debugging time by identifying issues early on. But did you know that you can also create your own custom Lint rules?\r\n\r\nIn this talk, we'll dive deep into the world of Android Lint and explore how to create custom rules that fit our specific needs. We'll cover the basics of how Lint works, the different types of rules that we can create, and some practical examples of how to use Lint to improve code quality at scale.\r\n\r\nBy the end of this talk, you'll have a solid understanding of how to use Android Lint to improve code quality and productivity on your projects. You'll be equipped with the knowledge to create your own custom rules and ensure that your codebase is clean and maintainable at all times.",
      "start": "2023-04-27T11:25:00",
      "end": "2023-04-27T11:45:00",
      "speakerIds": [
        "9a7f5add-ce7a-49a3-ab3d-f3c4484453e8"
      ],
      "roomId": "31080"
    },
    {
      "id": "455769",
      "title": "The joys and challenges of building a paywall with BillingClient 5",
      "description": "With Google I/O '23 approaching, the time to migrate to Google Play Billing Library 5 (PBL5) is halfway done. There are good reasons to migrate sooner, rather than later, though:\r\n\r\nIn this talk, you'll learn how the flexibility offered by BillingClient 5 enables new paywall configurations and functionality, with working examples for you to implement yourself. We'll also highlight the challenges we ran in while upgrading the RevenueCat library to support these changes, many of which are incredibly relevant if you're one of the hundreds of thousands of Android apps that still need to migrate to PBL5.\r\n\r\nYou'll leave the talk with a better understanding of real-world implementations of Billing Library 5, its benefits and its challenges, setting you up for a more successful migration down the road.\r\n",
      "start": "2023-04-27T11:25:00",
      "end": "2023-04-27T11:45:00",
      "speakerIds": [
        "944b39a5-752a-40e4-aa2b-dcc8e0f6da38",
        "1fcef224-ed23-4d8d-8e07-4855817796fd"
      ],
      "roomId": "31081"
    },
    {
      "id": "454815",
      "title": "Tauri / Dioxus : ces nouveaux frameworks Rust qui veulent faire du mobile",
      "description": "Pour remplacer ElectronJS (basé sur Chromium), des nouvelles alternatives écrites en Rust se sont multipliées comme Tauri et Dioxus.\r\n\r\nDans ce talk, nous verrons ce que permettent ces nouveaux frameworks et s'ils sont prêts à faire du mobile et ainsi concurrence Flutter et React Native.",
      "start": "2023-04-27T11:25:00",
      "end": "2023-04-27T11:45:00",
      "speakerIds": [
        "b88bee58-a4e3-4a47-be4d-85c9421457cc"
      ],
      "roomId": "33634"
    },
    {
      "id": "430933",
      "title": "Staying passionate about your craft",
      "description": "Like projects, careers aren't static and they definitely have their ups and downs. And while work isn't the most important thing in life, it does take up a sizeable amount of our time. So how can you remain excited to go to work every morning?\r\n\r\nIn this talk, Jeroen will reflect back at his decade long software development career. We'll have a laugh at all the poor choices he made, see how luck tends to shape the most pivotal moments and even have an open conversation about the absolute lows.\r\n\r\nFrom leading a 14+ people team, to becoming a GDE, starting his own business, doing remote work being 9(!) timezones ahead and having three lovely children... It makes for an interesting story, but not a silver bullet to a happy career. Hopefully though, Jeroen can shed some light on how to make",
      "start": "2023-04-27T11:50:00",
      "end": "2023-04-27T12:35:00",
      "speakerIds": [
        "b3770b77-c9c8-454d-8b7a-045ca1d66b7b"
      ],
      "roomId": "31079"
    },
    {
      "id": "434436",
      "title": "Forging the path from monolith to multi-module app",
      "description": "Going from a monolith to a multi-module project is a long process, that requires careful planning and a well-thought through strategy, especially in medium-large teams.\r\n\r\nThe TIER application is evolving to a multi-module structure and this talk will be the logbook of the journey, covering the approach that we followed and the philosophy behind the choices that we’ve made with both the mobile platforms in mind.\r\n\r\nI will tell you how to balance the entire process without harming the regular feature delivery schedule, where to start modularising, and improvements to the build tools to make life less miserable.",
      "start": "2023-04-27T11:50:00",
      "end": "2023-04-27T12:35:00",
      "speakerIds": [
        "aeddc24f-0e47-4934-ad76-2de7a9dc9fac"
      ],
      "roomId": "31080"
    },
    {
      "id": "464671",
      "title": "How Wildlife Studios maximizes mobile game performance and discoverability",
      "description": "Wildlife Studios, one of the world’s largest and most successful mobile game studios, has more than 60 mobile games in their portfolio, across Android and iOS. Whether they’re launching new titles or shipping updated content to live games, they’ve built their reputation on their ability to continually delight users with some of the best mobile experiences in gaming. \r\n\r\nKey to maximizing game quality and organic discoverability is meeting the strict technical requirements of The App Store and Google Play — not an easy feat when delivering cutting-edge experiences to a diverse, worldwide audience.\r\n\r\nIn this presentation, Wildlife Studios Manager of Engineering Operations, Lucas Klegen, shares how his teams maximize and maintain high technical performance at scale, including how they’re: \r\n\r\n- Keeping games consistently below the Google Play Console bad behavior thresholds.\r\n- Increasing the frequency in which games are featured across The App Store and Google Play.\r\n- Leveraging best-in-class insights to focus on actual issues and not false alarms. \r\n- Anticipating issues before having to hear about them from players.",
      "start": "2023-04-27T11:50:00",
      "end": "2023-04-27T12:35:00",
      "speakerIds": [
        "bd3e3257-9d05-4f72-9225-50908473778d"
      ],
      "roomId": "31081"
    },
    {
      "id": "429911",
      "title": "Collapsing toolbar avec effet parallaxe et animation en courbe avec Jetpack Compose",
      "description": "Animations are super important when building an application. They highlight relations between elements, bring attention to what is important and they also can express a brand style.\r\n\r\nIn this talk, I’ll show you how to implement a collapsing toolbar with parallax effect in jetpack compose only (no third party library). I’ll also show you how to implement curved motion using  the power of quadratic Bézier curve which is already ubiquitous in game development but now become so accessible in Jetpack Compose.\r\n\r\nSo if you want to learn how to build any custom linear animations, or animate objects along a curved path in Compose without impacting performance, join in 😎",
      "start": "2023-04-27T11:50:00",
      "end": "2023-04-27T12:15:00",
      "speakerIds": [
        "ca3e1da2-cfce-4823-8e14-a886f2483c2c"
      ],
      "roomId": "33634"
    },
    {
      "id": "6ef3a0b9-9aa5-464c-aa80-10bd2f12c649",
      "title": "Lunch",
      "description": null,
      "start": "2023-04-27T12:35:00",
      "end": "2023-04-27T13:50:00",
      "speakerIds": [],
      "roomId": "31079"
    },
    {
      "id": "469867",
      "title": "Exposing Data",
      "description": "Exposed is a lightweight open source library built from the ground up using Kotlin. It provides you with two ways of interacting with relational data - either using a Data Access Object approach, or via a DSL that provide strongly-typed SQL-like syntax. In this presentation we'll cover the basics of Exposed and how to get up and running with it, no matter the approach used. We'll bake into real-world usage scenarios by combing it with a server-side application built in Ktor.",
      "start": "2023-04-27T13:50:00",
      "end": "2023-04-27T14:35:00",
      "speakerIds": [
        "3ff1f933-847b-4e0d-8e01-c2ca21bbab5d"
      ],
      "roomId": "31079"
    },
    {
      "id": "423061",
      "title": "SwiftUI vs Jetpack Compose par un Ingénieur Android",
      "description": "En tant que ingénieur Android, Jetpack Compose est une révolution. La confection des interfaces, la maintenance du code et la compatibilité avec les plus vieilles versions d’Android sont seulement quelques points qui font de cette librairie l’une des plus incontournables de la suite Jetpack. Mais du côté de la pomme, SwiftUI s’est aussi imposé comme une alternative incontournable dans le développement d’interface pour les appareils Apple.\r\n\r\nJe vous propose de monter sur le ring et de mettre face à face SwiftUI à ma droite et Jetpack Compose à ma gauche. Nous allons comparer leur design, leur usage, leurs différences et leurs perspectives pour avoir un vainqueur et voir qui remporte ce match.\r\n\r\nPrenez pop-corn et mauvaise foi, il va y avoir du sang !",
      "start": "2023-04-27T13:50:00",
      "end": "2023-04-27T14:35:00",
      "speakerIds": [
        "6520ad1e-8c4e-45c1-b34d-91ca73db27fe"
      ],
      "roomId": "31080"
    },
    {
      "id": "456540",
      "title": "Designing for foldables in 2023",
      "description": "With the increasing number in the market of foldable and large screen devices, Designers and Developers need to pay special attention to optimizing their apps for each screen resolution and state and ensure an optimal user experience, no matter the device that is used.\r\n\r\nIn this session, we’ll look at key design principles for adaptive layouts and best practices when designing and building apps for different screen sizes.\r\nWe’ll also explore the key aspects of canonical layouts and their applications to real products. \r\n\r\n",
      "start": "2023-04-27T13:50:00",
      "end": "2023-04-27T14:35:00",
      "speakerIds": [
        "2f606e32-997a-4b74-8420-76a47e7d66a3",
        "97bc557b-01db-4ffc-813c-2c4c1a99500c"
      ],
      "roomId": "31081"
    },
    {
      "id": "864c40a7-bbf1-490b-8fab-312911ddbdec",
      "title": "Break",
      "description": null,
      "start": "2023-04-27T14:35:00",
      "end": "2023-04-27T14:50:00",
      "speakerIds": [],
      "roomId": "31079"
    },
    {
      "id": "453896",
      "title": "90s Website …  in 2023 on mobile in Compose … for science",
      "description": "Why  would anyone build something with a 90s website aesthetic - in Compose? Nostalgia? For one the 90s website aesthetic made heavy use of animations and visual effects. So emulating this style will take any animation framework through its paces. This talk will take some of the most iconic 90s website elements and demonstrate how to reproduce them to build  a retro mobile experience using Jetpack Compose. \r\n\r\nI can’t promise the end result will have a good user experience but I can promise a good look at the animation system in Compose and a collection of cheesy code snippets.",
      "start": "2023-04-27T14:50:00",
      "end": "2023-04-27T15:35:00",
      "speakerIds": [
        "2313d8eb-7d6e-444d-8e8d-4d223f896ce8"
      ],
      "roomId": "31079"
    },
    {
      "id": "419284",
      "title": "Collaborating with Protobuf & Type-Safe APIs",
      "description": "Collaboration across different stacks is complicated both within teams and across organizations. In this talk, we'll explore a real world case study: How Protobuf was integrated at Lyft (a U.S. ride-share company) and how it unlocked code generation to help improve the development experience and velocity for engineers working together across platforms. At the end of this talk, you'll be equipped with the understanding of how to use Protobuf to easily improve your development workflow.",
      "start": "2023-04-27T14:50:00",
      "end": "2023-04-27T15:10:00",
      "speakerIds": [
        "e79f9a2d-dd0a-4e40-bd83-57abdcc07147"
      ],
      "roomId": "31080"
    },
    {
      "id": "422755",
      "title": "AI won't take your job but it sure will help you do it better",
      "description": "Get your code generation and suggestion tasks done in a jiffy with AI!\r\n\r\nIn this session, we'll demonstrate how to use Github's Co-Pilot and chat GPT to automate the creation of code for data classes, services, and repositories. You'll see firsthand how these tools can save you time and effort by generating boilerplate code for you.\r\n\r\nWe'll also show you how to use these tools to create pull requests and Jira tickets with ease. \r\n\r\nTo round out the session, we'll live code an Android app that uses the OpenAI API to find the perfect GIF for any message.\r\n\r\nJoin me to discover how AI can make your programming life easier and more enjoyable. You'll leave the session with a set of new tools and techniques to help you get your code done faster and more efficiently.\r\n\r\nOh and yes, this description was written by a.i.",
      "start": "2023-04-27T14:50:00",
      "end": "2023-04-27T15:35:00",
      "speakerIds": [
        "3192eb25-047c-4d7e-874a-53206c185074"
      ],
      "roomId": "31081"
    },
    {
      "id": "455254",
      "title": "Embarquer votre modèle de machine learning dans votre app ?",
      "description": "Comment exécuter des modèles d'apprentissage automatique sur téléphone ? Comment télécharger le modèle et les données supplémentaires ? Est-ce que cela fonctionne bien ? Même dans une application React Native ?\r\n\r\nPl@ntNet dispose d'un modèle d'identification hors ligne/embarqué qui a été directement créé à partir de notre modèle de production côté serveur.\r\nNous avions besoin de télécharger le modèle, ainsi que les informations et les noms des espèces de plantes que nous ne voulions pas rendre facilement lisibles par d'autres. Mais nous souhaitions également disposer de données supplémentaires telles que des images d'illustration.\r\nNous avons eu quelques problèmes de mise en place, nous allons donc approfondir l'implémentation dans React Native avec un peu de code natif sur Android/iOS (java/swift).\r\n\r\nEnfin, est-ce que cela fonctionne bien ? Comment se compare-t-il à notre processus côté serveur ? ",
      "start": "2023-04-27T14:50:00",
      "end": "2023-04-27T15:10:00",
      "speakerIds": [
        "60549250-148e-46a0-9868-f5d31b5f7499"
      ],
      "roomId": "33634"
    },
    {
      "id": "445351",
      "title": "How to use hardware acceleration for Machine Learning inference on Android",
      "description": "The rising processing power of Android devices unlocks on-device machine learning capabilities unthinkable a few years ago.\r\n\r\nTo enable machine learning real-time experiences (augmented reality filters, live speech transcription, etc…) you need to accelerate ML processes. TensorFlow Lite on Android can leverage specialized hardware available on the device (GPU, DSP, NPU, etc…).\r\n\r\nIn this session we will explain how to use Acceleration delegates and new TensorFlow Lite Android APIs to enable ML hardware acceleration.\r\n\r\n#tflite #ML #AI #gpu #performance",
      "start": "2023-04-27T15:15:00",
      "end": "2023-04-27T15:35:00",
      "speakerIds": [
        "f8c30c09-8132-4ac8-91a5-9e7b293063a4",
        "791d1128-88d2-4f3f-9917-9e4c1f1ea961"
      ],
      "roomId": "31080"
    },
    {
      "id": "455750",
      "title": "Tests unitaires avec KotlinFlow",
      "description": "Lorsque nous développons une fonctionnalité, nous devons écrire les tests unitaires. C'est une partie essentielle du développement. Cela assure le bon fonctionnement du code lors de futurs changements ou refactorisations.\r\n\r\nKotlin Flow ne fait pas exception. Nous avons besoin de tester le fonctionnement de nos flux de données. \r\n\r\nTandis que nous verrons la facilité de tester un Flow, quand les delays sont utilisés, que les différents context de coroutines s'en mêlent, on peut sentir les migraines arrivées...\r\n\r\nMais, avec kotlinx-coroutines-test, Kluent et Turbine, écrire des tests unitaires succincts et lisibles reste facile et simple.",
      "start": "2023-04-27T15:15:00",
      "end": "2023-04-27T15:35:00",
      "speakerIds": [
        "f63fcbea-0846-4b5e-b174-e1e9a5359964"
      ],
      "roomId": "33634"
    },
    {
      "id": "da60a02c-c5e7-409e-8858-c7e45e9583f4",
      "title": "Break",
      "description": null,
      "start": "2023-04-27T15:35:00",
      "end": "2023-04-27T15:50:00",
      "speakerIds": [],
      "roomId": "31079"
    },
    {
      "id": "454972",
      "title": "Unusable or Undebuggable? Rebelling against \"best practices\"",
      "description": "Thanks to new Compose libraries, making a good looking Wear OS app is becoming very easy!\r\n\r\nHowever, on the watch, if you need to scroll, LazyColumn gives you 5-10 frames per second at best in debug mode.\r\n\r\nUnusable? Unacceptable!\r\n\r\nActually, I noticed the scrolling performance wasn't that great in debug on the phone too, so I went on to fix this, succeeded, and got bonus features I missed in LazyColumn!\r\n\r\nYou'll learn the full story and see how it's all implemented.",
      "start": "2023-04-27T15:50:00",
      "end": "2023-04-27T16:10:00",
      "speakerIds": [
        "7c1cede6-5f59-46bb-ad1e-22b63758dae7"
      ],
      "roomId": "31079"
    },
    {
      "id": "454421",
      "title": "Going on a road trip with Android Auto",
      "description": "Android is truly everywhere. It's running on the phone, watch, TV, car, and there are even some fridges and toasters that want to be part of the family. While they're still under development, Android Auto is starting to gain a lot of adoption.\r\n\r\nIn this talk, we're going to travel around the road of Android Auto, see its use cases and go through its functionalities, so you can later implement them on your app. All of this without moving your desk to be inside a car.\r\n\r\nJump in, it's going to be an amazing journey.",
      "start": "2023-04-27T15:50:00",
      "end": "2023-04-27T16:10:00",
      "speakerIds": [
        "2bc1e95f-1243-4ad0-8a11-75541fee10e0"
      ],
      "roomId": "31080"
    },
    {
      "id": "454627",
      "title": "Comment gagner en efficacité avec les file templates ?",
      "description": "Android Studio est basé sur IDEA. Cela signifie que nous avons accès aux live et file templates des IDE d'IntelliJ. L'intérêt est de produire le code répétitif en quelques touches.\r\n\r\nLe but de cette présentation : vous convaincre que les file templates sont une solution viable pour accélérer une partie du développement !\r\n\r\nCe que vous allez apprendre:\r\n- Qu'est-ce qu'un file template ?\r\n- Comment générer plusieurs fichiers ?\r\n- Comment les utiliser sur MVVM Compose ou Room ?",
      "start": "2023-04-27T15:50:00",
      "end": "2023-04-27T16:10:00",
      "speakerIds": [
        "13e3361f-310d-4d75-a593-bb3acfee08a7",
        "424072c4-ac7b-45e0-9d63-34903356b74c"
      ],
      "roomId": "31081"
    },
    {
      "id": "441771",
      "title": "I have a Date",
      "description": "One common task in Android app development is working with Date object, and Kotlin provides several options for managing it. In this talk, we will explore the different ways to represent and manipulate dates in Kotlin, including using the built-in java.util.Date class, the third-party Joda-Time library, and the java.time package introduced in Java 8. We will also discuss best practices for formatting and displaying dates to the user, and handling time zones and daylight saving time. By the end of this talk, attendees will have a strong understanding of how to effectively manage dates in their Kotlin Android apps.",
      "start": "2023-04-27T15:50:00",
      "end": "2023-04-27T16:10:00",
      "speakerIds": [
        "4674e36f-50f8-4ffb-a486-679d730c759e"
      ],
      "roomId": "33634"
    },
    {
      "id": "441542",
      "title": "The Rise and Fall of Feature Teams",
      "description": "At some point, organizations scale up – they move their platform teams to a setup with cross-functional teams. From now on designers, backend and mobile developers will work together day by day instead of waiting for each other. You will have all the resources you need within your team. And it makes sure that everyone in your team is working on the same thing, preventing isolated islands or working at different speeds, the perfect knowledge-sharing approach,\r\nWhat if I tell you that in practice this promising world often collapses and at least leads to a new world of problems you have to deal with now? Was it just a nice dream that can turn into a nightmare?\r\n\r\nAt SoundCloud we went through these setups, we worked like this and we realized it wasn't helping us in the way we wanted. Let me tell you why and what where we ended up with now!\r\n",
      "start": "2023-04-27T16:15:00",
      "end": "2023-04-27T16:35:00",
      "speakerIds": [
        "4d3a31b1-61e5-4a26-9ca3-c9f30e3eaa08"
      ],
      "roomId": "31079"
    },
    {
      "id": "442026",
      "title": "Become a Maestro of Mobile Testing in 5 minutes",
      "description": "Maestro is the latest tool of the mobile.dev team (former Uber mobile platform engineers). \r\n\r\nThe concept is simple: adopt the shift left on your mobile app to prevent problems in production. \r\n\r\nWe will present a brief introduction of this tool that allows you to build end to end tests in a breeze without knowledge of any end to end test technologies. \r\n",
      "start": "2023-04-27T16:15:00",
      "end": "2023-04-27T16:35:00",
      "speakerIds": [
        "05385600-cf94-4333-afb3-0ebb5f9d0269",
        "22ac76a5-35b4-478c-a2c6-f7b8a4169928"
      ],
      "roomId": "31080"
    },
    {
      "id": "424855",
      "title": "Réaliser rapidement un jeu cross-platform avec Flutter et Firebase",
      "description": "Dans ce workshop nous allons voir les bases de Flutter et de Firebase à l'aide d'un petit jeu.\r\n- Création d'un projet Flutter\r\n- Création d'un petit jeu simple à l'aide de Widgets de base afin de découvrir Flutter\r\n- Connexion à un projet Firebase\r\n- Ajout des résultats des parties dans une collection Firestore\r\n- Utilisation de Firestore pour voir les résultats de la partie en direct\r\nA la fin de cette workshop, vous aurez un aperçu des composants de base de Flutter ainsi que les possibilités qu'offre Firebase et Firestore pour facilement ajouter des fonctionnalités à une application Flutter.\r\n",
      "start": "2023-04-27T16:15:00",
      "end": "2023-04-27T17:35:00",
      "speakerIds": [
        "3d34325b-8080-415c-9324-b06d036c5cab"
      ],
      "roomId": "31081"
    },
    {
      "id": "452498",
      "title": "Make Gradle work for you, create your own tasks and plugins",
      "description": "As Android developers, we often interact with build.gradle(.kts) and settings.gradle(.kts) to build our apps with Gradle. Sometimes, we add a plugin that magically provides us with some needed features (aka Tasks) without knowing how it works under the hood. \r\n\r\nDiscover the power of Gradle and how you can script some manual and painful tasks to make Gradle work for you.\r\n\r\nDuring this presentation, you will learn:\r\n\r\n- What is a Task, and how to create your own\r\n- What is a Plugin, and how to create your own\r\n- Provide a nice DSL to configure your tasks\r\n- How to publish your plugin",
      "start": "2023-04-27T16:15:00",
      "end": "2023-04-27T16:35:00",
      "speakerIds": [
        "a20010e8-b898-465f-84c8-69d93ae46194",
        "23c58f10-a1d1-4c3d-aa8c-caed84503b97"
      ],
      "roomId": "33634"
    },
    {
      "id": "b08dd7ed-1371-4cf6-96e9-a5f37a54df4e",
      "title": "Break",
      "description": null,
      "start": "2023-04-27T16:35:00",
      "end": "2023-04-27T16:50:00",
      "speakerIds": [],
      "roomId": "31079"
    },
    {
      "id": "442732",
      "title": "Practical ADB usage to enhance your life!",
      "description": "ADB is an incredibly underutilized tool that can dramatically improve your Android development experience! Maybe you know some basic ADB commands, perhaps even a couple of nifty advanced ones or possibly, you don’t know what ADB even is!\r\n\r\nImagine automatically & swiftly logging into your app’s test account, instantly inspecting your app’s current Activity/Fragment stack or editing your app’s shared preferences & phone settings all without touching your device! All this and SO MUCH MORE is possible thanks to ADB.\r\n\r\nThis session is not intended to blast you with a list of ADB commands but instead to share a collection of practical scenarios & examples how you can use this supreme tool everyday in a variety of ACTUALLY useful ways. \r\n\r\nJoin me in this session, regardless of your experience, as we explore what this tool can really do to change the way you work forever!",
      "start": "2023-04-27T16:50:00",
      "end": "2023-04-27T17:35:00",
      "speakerIds": [
        "5f8860b3-e669-4717-91bf-ddceb872fd55"
      ],
      "roomId": "31079"
    },
    {
      "id": "436372",
      "title": "Go with the Flow",
      "description": "Kotlin Flow is an implementation of Reactive Stream specification made on top of coroutines for Kotlin.\r\n\r\nIn this talk, we will look at Kotlin Flow, it's internals, how to use it with on Android or any other platforms, and share how you can migrate to Flow\r\n\r\nAgenda\r\n- Quick intro to Flow\r\n- Internals of Kotlin Flow\r\n- Using Flow on Android and other platforms\r\n- Why and how to migrate\r\n- Working with existing reactive streams ❤ Flow in single codebase\r\n- Magic of multi-platform\r\n- Tests\r\n- Conclusion\r\n\r\nYou’ll walk away with a clear idea of what Kotlin Flow and how it works internally and how you can level up your reactive game",
      "start": "2023-04-27T16:50:00",
      "end": "2023-04-27T17:35:00",
      "speakerIds": [
        "a82de654-53d7-4c16-989a-5efddf36983e"
      ],
      "roomId": "31080"
    },
    {
      "id": "418036",
      "title": "Let's shake the Flutter tree",
      "description": "The more platforms a Flutter application supports, the more code a project can have that is needed only for one platform and not needed for others. How to make sure that unnecessary code does not get into the final platform-specific build? And how to check that it really did not get?\r\n\r\nIn Flutter, there is a Tree-shaking mechanism, which is designed exactly for these purposes. Many Flutter developers have heard about it, but not everyone really understands what it is and how it actually works. Let's try to figure it out.",
      "start": "2023-04-27T16:50:00",
      "end": "2023-04-27T17:35:00",
      "speakerIds": [
        "c73c2377-026f-4b6a-b1f7-91a536c33c67"
      ],
      "roomId": "33634"
    },
    {
      "id": "6ae29154-bed0-4ddb-8a73-b6135b0e27e1",
      "title": "Break",
      "description": null,
      "start": "2023-04-27T17:35:00",
      "end": "2023-04-27T17:50:00",
      "speakerIds": [],
      "roomId": "31079"
    },
    {
      "id": "455494",
      "title": "Un Design System, ça se Compose !",
      "description": "Depuis la publication de la première version stable Jetpack Compose il y a près de 2 ans, l’intérêt pour cette technologie n’a fait qu’augmenter, et son adoption dans les nouveaux projets est une évidence. Cependant, son intégration dans des projets ayant des codebases conséquentes et anciennes est une autre affaire.\r\n\r\nChez Deezer, nous travaillons depuis plusieurs années avec un Design System afin d’améliorer la productivité et la consistance de nos projets. Aussi, la synergie entre Compose et les Design Systems, grâce à la composition, nous est apparue comme une excellente opportunité pour accélérer nos futurs développements et créer de nouvelles interfaces saisissantes. Nous avons, par conséquent, établi une stratégie afin de migrer notre Design System et utiliser Compose pour nos nouvelles implémentations, mais aussi de migrer nos fonctionnalités existantes. En voici les différentes étapes : \r\n- Migration d'une page existante afin de monter en compétence sur les nouveaux paradigmes introduits par Compose\r\n- Définition d’une roadmap visant à initier un nouveau Design System en Compose, en suivant les principes de l’Atomic Design\r\n- Conception de l’API de nos composants afin de les rendre à la fois flexibles et réutilisables, notamment sur l’usage d’API par “slot” ou encore de modèles pour les composants UI\r\n- Spécifications des guidelines et standards, à la fois pour l’usage du nouveau Design System mais aussi pour les nouveaux développements en Compose\r\n\r\n\r\nNotre retour d'expérience vous permettra de découvrir différentes solutions, de mieux comprendre les pièges à éviter (dans lesquels nous sommes parfois tombés), et d’imaginer quelle stratégie adopter pour migrer vos propres applications en Compose.\r\n",
      "start": "2023-04-27T17:50:00",
      "end": "2023-04-27T18:35:00",
      "speakerIds": [
        "d74d249a-ce9e-4887-93a0-fa19d73a501d",
        "8e90a4dc-33fc-4000-9bcb-802e45b50d87"
      ],
      "roomId": "31079"
    },
    {
      "id": "456538",
      "title": "Journey of the Android white label process",
      "description": "White labelling is an integral process for customising on-demand solutions at ioki. We have 80 modules in-app and 70+ projects being released biweekly, a number that is ever-growing! With an increasing number of features and code, we need to separate responsibilities between the core feature-driven app and the white-label projects, while optimising for scalability. \r\n\r\nDuring this talk, we will discuss\r\n- how Android platform features like modularisation, product flavors and resource overriding can shape the white labelling pipeline,\r\n- how we can continuously evolve our project architecture to fit team and product requirements,\r\n- how to isolate the core features of an app from the customisation process, and\r\n- what makes for a successful run to a new white-label project release!",
      "start": "2023-04-27T17:50:00",
      "end": "2023-04-27T18:35:00",
      "speakerIds": [
        "c35f2359-2c5c-4b88-a4bc-024a6c025ce4"
      ],
      "roomId": "31080"
    },
    {
      "id": "fd36b22f-dd2a-414c-806f-fdad9d68b14b",
      "title": "(Cont. from 4:15 session start) Réaliser rapidement un jeu cross-platform avec Flutter et Firebase",
      "description": "Workshop session continued.",
      "start": "2023-04-27T17:50:00",
      "end": "2023-04-27T18:35:00",
      "speakerIds": [],
      "roomId": "31081"
    },
    {
      "id": "433488",
      "title": "Take a look at Jetpack Glance",
      "description": "Jetpack Glance is the new shiny library in the Jetpack family for creating widgets. At first glance, it resembles a Jetpack Compose, but in many cases, it is really different. Learn those differences and create beautiful widgets easily.\r\nDuring this talk, I will describe how the Jetpack Glance works, what are the differences between it and RemoteViews widgets. You will also learn why we still need some XMLs, how to manage the state, and periodic updates.",
      "start": "2023-04-27T17:50:00",
      "end": "2023-04-27T18:35:00",
      "speakerIds": [
        "b6dc4b56-ca5d-4e55-8a57-e37f6e6d6af0"
      ],
      "roomId": "33634"
    },
    {
      "id": "dbc9fca5-44e0-4873-914f-4525fad5a0e3",
      "title": "Party",
      "description": null,
      "start": "2023-04-27T19:00:00",
      "end": "2023-04-27T20:00:00",
      "speakerIds": [],
      "roomId": "31079"
    },
    {
      "id": "52ca2f2c-31ac-492c-88fe-50f92084a797",
      "title": "Check-in & Registration",
      "description": null,
      "start": "2023-04-28T08:30:00",
      "end": "2023-04-28T09:20:00",
      "speakerIds": [],
      "roomId": "31079"
    },
    {
      "id": "6ffcdfcd-4967-40a3-8463-fca33e654d74",
      "title": "Opening",
      "description": null,
      "start": "2023-04-28T09:20:00",
      "end": "2023-04-28T09:30:00",
      "speakerIds": [],
      "roomId": "31079"
    },
    {
      "id": "452238",
      "title": "What a Long Strange Trip it's Been: A Year In Android",
      "description": "The Android community is a fast evolving society of excellent people who passionately involve themselves in their ecosystem. This means the progress of developments can be fast, blazingly fast! \r\n\r\nInspired by other content creators and newsletters that keep us informed about the most recent events, I decided to document news, events, and releases every week for a year. Starting from the end of Droidcon Berlin, the world’s best Android developer conference.\r\n\r\nAccompany me in this journey to look over all the events of this last year, from the end of Droidcon Berlin 2022 up until right now!",
      "start": "2023-04-28T09:30:00",
      "end": "2023-04-28T10:15:00",
      "speakerIds": [
        "10659767-356c-4cd5-ba9c-12cec7a3ce79"
      ],
      "roomId": "31079"
    },
    {
      "id": "48935f5b-4e47-4a6d-81cc-74fa7520ce7f",
      "title": "Break",
      "description": null,
      "start": "2023-04-28T10:15:00",
      "end": "2023-04-28T10:40:00",
      "speakerIds": [],
      "roomId": "31079"
    },
    {
      "id": "419559",
      "title": "Sweet Architecture",
      "description": "How about unidirectional data flow in an architecture where views and presenters don’t know about each other? While growing up to 40+ engineers and 600+ modules, Cash App managed to control the complexity of its product. Views can be written in either Kotlin or XML; presenters with either Rx, Coroutines, or Compose; no problem. We test views on the JVM and we don’t need to define fake presenters either.\r\n\r\nWriting new screens is delightful and we’ll see how we made it possible by:\r\n- Looking at the foundations of the architecture: our internal navigation library which allows clear modularity,\r\n- Checking how it can adapt to presenters using different technologies,\r\n- Explaining how views are defined and tested,\r\n- Seeing how everything is glued together from a bird’s-eye view of the app.\r\n\r\nGrowing your app and team doesn’t imply more pain nor more complexity. Attendees will gain a sound understanding about how we achieved it.\r\n",
      "start": "2023-04-28T10:40:00",
      "end": "2023-04-28T11:25:00",
      "speakerIds": [
        "449b4215-55cc-444f-8ff4-b0c434a96019"
      ],
      "roomId": "31079"
    },
    {
      "id": "454848",
      "title": "How to ship apps better, faster, stronger",
      "description": "Shipping mobile apps has evolved a lot over the past decade. This session will go over the latest best practices in terms of Continuous Delivery for mobile: How to ship apps continuously? How to use Feature Flags to release safely? Which branching strategy to use? How to monitor a release once it's shipped?",
      "start": "2023-04-28T10:40:00",
      "end": "2023-04-28T11:25:00",
      "speakerIds": [
        "0b1323da-2946-49de-be5c-e54d44e12325"
      ],
      "roomId": "31080"
    },
    {
      "id": "446247",
      "title": "Let's discover the possibilities of Kotlin beyond Android",
      "description": "You're already developing Android apps with Kotlin ? Then, you're not far from being a FullStack and cross-platform developer. \r\n\r\nIndeed, the Kotlin ecosystem is versatile, allowing to develop many types of apps such servers, CLIs, Desktop apps and mobile apps, etc.\r\n\r\nIn this this coding workshop, we'll explore some possibilities of the Kotlin ecosystem outside of pure Android development. More specifically, we'll create these apps:\r\n\r\n- A REST API Server with KTOR\r\n- A Cross-platform web app with Compose Multiplatform\r\n- A Cross-platform Desktop / Android app with Compose Multiplatform\r\n- An cross-platform iOS / Android library with KMM\r\n\r\nHere are the prerequisites:\r\n- IntelliJ IDEA Community or Ultimate edition\r\n- Android Studio with the KMM plugin\r\n\r\nThe workshop material is available online: https://worldline.github.io/learning-kotlin. The source code of the workshop is available on GitHub: https://worldline.github.io/learning-kotlin/",
      "start": "2023-04-28T10:40:00",
      "end": "2023-04-28T12:25:00",
      "speakerIds": [
        "53bb8035-14c0-479a-9c9d-cc7c9b50c6ff",
        "fa6ac12a-6cbe-4dd0-8ee0-3d05ddbc2262"
      ],
      "roomId": "31081"
    },
    {
      "id": "455676",
      "title": "App Clinic",
      "description": "A team of experts will come on stage and review a series of applications proposed by the audience.\r\n\r\nYou can send your application to app.clinic@androidmakers.fr (PlayStore link or APK)",
      "start": "2023-04-28T10:40:00",
      "end": "2023-04-28T12:25:00",
      "speakerIds": [
        "9f35aab3-8baf-4a74-97a0-735dd9a2479f"
      ],
      "roomId": "33634"
    },
    {
      "id": "0fa7e624-76c5-44e0-8579-dbb2329f3385",
      "title": "Break",
      "description": null,
      "start": "2023-04-28T11:25:00",
      "end": "2023-04-28T11:40:00",
      "speakerIds": [],
      "roomId": "31079"
    },
    {
      "id": "456499",
      "title": "Off to the Races with Android",
      "description": "With the advent of modern 5G, single digits millisecond network latency is no longer a pipe dream, and on public networks, you can typically get 40ms to 50ms latency. To create buzz around these performance numbers, Bell 5G/MEC Innovation Lab came to us with an exciting project proposition: Create a remote-presence, high-performance model car racing experience for the Montreal Formula One Grand Prix.\r\n\r\nWe will present our approach to building this unique experience using cutting-edge technologies such as computer vision, machine learning and real-time communication. We'll discuss the technical challenges we faced and our solutions. Our core pillar is an Android phone controlling customized microcontrollers over USB integrating multiple sensors. Supervising the races, an overseeing machine-learning model. We'll also have a rare look into the cell network hardware needed to keep everything responsive and exciting.\r\n\r\nThis talk should be of interest to Android developers, robotics and IoT enthusiasts, as well as ML specialists looking for novel ways to combine the use of these technologies.",
      "start": "2023-04-28T11:40:00",
      "end": "2023-04-28T12:25:00",
      "speakerIds": [
        "878ec0bb-f4d7-4b83-a9af-ff6e359a35dc",
        "8f01dc41-f26d-41d9-a12d-1801e80795cf"
      ],
      "roomId": "31079"
    },
    {
      "id": "417890",
      "title": "Level up on Kotlin Multiplatform",
      "description": "Kotlin Multiplatform is a new cross-platform technology from JetBrains that is taking the mobile world by storm. Many Android and iOS developers have given this exciting technology a try. But how do you take your skills from building simple apps to more complex ones?\r\n\r\nThis talk aims to help mobile developers level up their Kotlin Multiplatform skills by introducing libraries such as Ktor, SQLDelight, and Koin. I will also discuss implementing common architectural patterns such as MVVM, MVI, and Clean. By the end of the talk, the audience will have a richer understanding of how to build complex Kotlin Multiplatform apps.",
      "start": "2023-04-28T11:40:00",
      "end": "2023-04-28T12:25:00",
      "speakerIds": [
        "62216efe-dd8b-4d8b-9800-1d51b57c4001"
      ],
      "roomId": "31080"
    },
    {
      "id": "9cfd7417-4060-49cc-9eed-8bad800ee158",
      "title": "Lunch",
      "description": null,
      "start": "2023-04-28T12:25:00",
      "end": "2023-04-28T14:00:00",
      "speakerIds": [],
      "roomId": "31079"
    },
    {
      "id": "450710",
      "title": "Confetti: building a Kotlin conference app in 40min 🎊",
      "description": "In this talk Martin and John will live code the development of Confetti, a fullstack conference app using a graphql-kotlin backend and KMM based mobile clients\r\n\r\nThe talk will cover\r\n- development of the graphql-kotlin backend\r\n- use of Apollo library and it's Kotlin Multiplatform support allowing addition of GraphQL queries and related logic in code shared between iOS and Android clients.\r\n- development of mobile clients that consume the shared KMM code (using Jetpack Compose on Android and SwiftUI on iOS)",
      "start": "2023-04-28T14:00:00",
      "end": "2023-04-28T14:45:00",
      "speakerIds": [
        "0392772c-28d4-47f6-bd39-47d743fb4a81",
        "56fda597-4927-4d25-9a80-4795d15ef080"
      ],
      "roomId": "31079"
    },
    {
      "id": "439280",
      "title": "Are your secrets secure - How mobile apps are leaking millions of credentials",
      "description": "Secrets like API keys, security certificates and other credentials are the crown jewels of our applications. They give access to our most sensitive information and systems like databases, cloud infrastructure and third-party services. Despite being highly sensitive, these secrets are being leaked in our source code and compiled mobile applications. \r\n\r\nThroughout the presentation, we will analyze two in-depth research projects to show how mobile applications and specifically android applications are leaking secrets. The presentation will be broken into three sections:\r\n\r\n**Part 1 - How attackers find and exploit secrets**\r\nWe break down a collection of real-life breaches where hackers discovered and exploited credentials to gain unlawful access to different services. How the credentials were discovered, how they were exploited, and what the attackers were able to access / control.\r\n\r\n**Part 2 - Secrets in source code**\r\nGitGuardian's 2022 State of Secrets Sprawl report showed more than 6 million secrets were leaked publicly through source code in 2021 on GitHub.com. This number increased again in the (yet to be released) 2023 State of Secrets Sprawl Report. We will focus specifically on how many secrets were discovered inside android projects including the total number of secrets found, common secrets discovered, and common files containing plain text secrets. \r\n\r\n**Part 3 - Secrets on the play store**\r\nThe third section will review research into how many mobile applications on the Google Play Store are leaking secrets. The research reviews nearly 50,000 apk files which were downloaded from the Play Store and decompiled to reveal how many contained secrets. We show the overwhelming percentage of apps that contained plain text secrets and the types of secrets commonly found. \r\n\r\nTogether these sections show that attackers are actively trying to find and exploit secrets in our applications and reveal two predominant ways they are getting leaked in public places. The presentation will finish with actionable steps developers can take to prevent secrets from leaking. \r\n",
      "start": "2023-04-28T14:00:00",
      "end": "2023-04-28T14:45:00",
      "speakerIds": [
        "4e52cb59-2074-4f77-ad95-1f7c36f3bb28"
      ],
      "roomId": "31080"
    },
    {
      "id": "454559",
      "title": "State of Bluetooth LE on Android in 2023",
      "description": "It's 2023 and we've had Bluetooth LE APIs on Android for almost 10 years. Are they stable now? Can you work with them? Why is this so difficult? In this session you'll learn how to use BLE on Android and how to avoid the common pitfalls. This session is useful for anyone doing anything around Bluetooth connectivity on Android.",
      "start": "2023-04-28T14:00:00",
      "end": "2023-04-28T14:45:00",
      "speakerIds": [
        "79823093-1b16-4a2b-b0a9-ea4cd25b92f5"
      ],
      "roomId": "31081"
    },
    {
      "id": "455173",
      "title": "~/git --help",
      "description": "Have you ever had an issue with git? Don't know which git command to use? Is your git slow in a big mono repo project?\r\n\r\nIf you answered YES to any of these questions, this talk is for you. First we will learn how git works under the hood which will give us a better understanding of several git commands. Second we will dive into the git features on Android Studio. Last but not least, share some tips on how to make the most out of git.\r\n\r\nAfter this talk, you will have the right knowledge to master git. Once you start to understand it, the terminology will make more sense and you’ll eventually learn to love it!",
      "start": "2023-04-28T14:00:00",
      "end": "2023-04-28T14:45:00",
      "speakerIds": [
        "1ee57fa9-790a-4a61-a980-6ef301818aea"
      ],
      "roomId": "33634"
    },
    {
      "id": "a53f543c-f61e-46d5-8982-e86d4c1c2bf0",
      "title": "Break",
      "description": null,
      "start": "2023-04-28T14:45:00",
      "end": "2023-04-28T15:00:00",
      "speakerIds": [],
      "roomId": "31079"
    },
    {
      "id": "435622",
      "title": "The Art of KMP: how I learned backend development with Kotlin and why you should too",
      "description": "KMP is not only KMM. You can also build web and desktop apps! And Kotlin doesn’t only work for Android, as many may think. You can build a backend for your app.\r\n\r\nIf you’re looking for a side project or just curious, I would suggest you try backend development with Kotlin. When I was starting with KMPizza I had a number of questions:\r\n\r\n- Is it reasonable/worth it to start learning Backend development with Kotlin? May be there is something different from Kotlin? I've heard good things about Go. Or should I rather choose Java frameworks as they are more mature? \r\n \r\n- Which framework is good to choose for a beginner? Kotlin Spring probably benefits from the maturity of Java Spring, whereas I have seen and heard more about Ktor implementations. Also using Ktor in the client side in KMM may be a good addition to learning backend with Ktor. \r\n \r\n- Any tutorials/starter projects/guides/learning kits?\r\n \r\nIn this talk I’m going to share what answers I found and how I learned backend development with Kotlin.",
      "start": "2023-04-28T15:00:00",
      "end": "2023-04-28T15:25:00",
      "speakerIds": [
        "6a7c1f8a-784d-46be-8840-9cf519c4bc78"
      ],
      "roomId": "31079"
    },
    {
      "id": "417951",
      "title": "Migrate to Gradle version catalog and convention plugins",
      "description": "Gradle always has been hard to grasp because of multiple ways to do the same thing. With the project scaling and requirements increasing it is crucial to scale our build logic and support developers across the teams. This talk will cover how to migrate to Gradle centralized version catalogs and share some of the build logic as convention plugins. This method is adopted by AndroidX project, Now In Android, and many more.",
      "start": "2023-04-28T15:00:00",
      "end": "2023-04-28T15:25:00",
      "speakerIds": [
        "12052406-2d03-4184-95a1-1098d88b9ce8"
      ],
      "roomId": "31080"
    },
    {
      "id": "454354",
      "title": "Boostez votre application mobile grâce à ChatGPT",
      "description": "ChatGPT et L'intelligence artificielle en général sont en train de révolutionner notre monde. Chez WeMoms (le réseau social de la maternité) on exploite ces outils au maximum pour booster le développement de nos apps Android : \r\n\r\n- rédaction de contenu \r\n- sortie de nouvelles fonctionnalités et génération d'images\r\n- génération de code personnalisés\r\n\r\nLes possibilités sont infinis. \r\n\r\nOn vous propose de vous embarquer dans l'aventure à travers trois exemples intégrés à notre app Android : \r\n- la création d'un outil pour trouver le prénom de son bébé avec GPT-3\r\n- La génération d'un outil de recette de cuisine avec GPT-3 et Dall-E\r\n- L'ajout d'animation et de nouvelles pages dans l'app avec ChatGPT\r\n\r\n*et au fait : ce résumé est généré par ChatGPT XD ",
      "start": "2023-04-28T15:00:00",
      "end": "2023-04-28T15:25:00",
      "speakerIds": [
        "edfe420a-8175-4064-9f50-b77a64358dd6"
      ],
      "roomId": "31081"
    },
    {
      "id": "441204",
      "title": "Introduction à l'observabilité sur mobile",
      "description": "Avec la croissance de votre companie, de votre équipe, beaucoup de changements se produisent :\r\nPlus de développeurs, une plus grosse codebase, plus de chance d'avoir des bugs, plus d'utilisateurs, des attentes plus fortes, plus de cas de bords, plus de configurations possible, etc.\r\n\r\nVoici la stratégie et les outils que nous avons mis en place chez Spendesk pour garder un oeil sur ce qu'il se passe réellement en production dans nos apps mobiles:\r\n- Détecter un bug ou des erreurs avant que l'utilisateur ne nous contacte.\r\n- Surveiller le comportement des features\r\n- Performances des app et des différentes fonctionnalités\r\n",
      "start": "2023-04-28T15:00:00",
      "end": "2023-04-28T15:25:00",
      "speakerIds": [
        "7659a5f9-d376-4ddb-aa96-892b34f40c23",
        "9860a793-5622-47ae-83bc-61d1e9c0fa0e"
      ],
      "roomId": "33634"
    },
    {
      "id": "755c57b9-28f1-4fdc-97ff-af9743df578c",
      "title": "Break",
      "description": null,
      "start": "2023-04-28T15:25:00",
      "end": "2023-04-28T15:40:00",
      "speakerIds": [],
      "roomId": "31079"
    },
    {
      "id": "417949",
      "title": "10 years of Android Development: The Retrospective",
      "description": "Working in the Android Development since 2011 when I made my first apps on a Galaxy S with Froyo (2.2) and there was no Fragment, Holo design was beautiful and ActionBarSherlock was the big thing!\r\n\r\nLet's see how Android Development has evolved during this 10-years timeframe with the rise of Fragments, Material design, and now Kotlin and Jetpack Compose with fun anecdotes and code samples.",
      "start": "2023-04-28T15:40:00",
      "end": "2023-04-28T16:25:00",
      "speakerIds": [
        "462e6b97-01f9-44b1-864c-9d85bedf911b"
      ],
      "roomId": "31079"
    },
    {
      "id": "431337",
      "title": "Les différentes stratégies de monétisation d'une application mobile",
      "description": "Il y a de nombreuses manières de monétiser une application mobile (Android, iOS...) :\r\n\r\n- Vendre son application sur les catalogues spécialisés (Google Play, Apple App Store, Amazon Appstore, etc.)\r\n- Intégrer des achats in-app (vendre du contenu virtuel, débloquer du contenu privilégié, etc.) ou une souscription régulière (paiement mensuel / annuel, etc.)\r\n- Intégrer du contenu publicitaire (bannières, interstitielles, publicités natives, publicités rewarded, etc.)\r\n- Entreprendre des partenariats (avec d'autres sociétés du même domaine d'activité)\r\n- Collecter et vendre les données de ses utilisateurs\r\n- Et bien d'autres encore.\r\n\r\nNous allons passer en revue ensemble ces différentes possibilités, grace à l'expérience que nous avons acquise avec nos propres applications (500k+ and 2M+ téléchargements)",
      "start": "2023-04-28T15:40:00",
      "end": "2023-04-28T16:25:00",
      "speakerIds": [
        "ae702dc9-e083-4643-b977-77b1f10cd26f",
        "85dc1d24-7fae-4f37-93f7-051b38f8a74d"
      ],
      "roomId": "31080"
    },
    {
      "id": "453147",
      "title": "Animations avec Compose : rendez vos apps chat-oyantes",
      "description": "Quoi de plus vivant qu’une belle interface animée ? Les équipes design rivalisent d’ingéniosité pour permettre à l’utilisateur de mieux comprendre le fonctionnement d’une application, grâce, notamment, aux animations. \r\n\r\nMais le terme \"animation\" fait souvent peur aux développeur·se·s. Les keyframes, les interpolateurs, les translations… un charabia qui peut encourager l’équipe de dev à freiner et à limiter les designers sur leurs idées.\r\n\r\nEt si on vous disait qu’implémenter des animations, c’est pas si difficile ?\r\n\r\nAvec Compose, le \"nouveau\" framework UI de Google, c’est même plutôt simple quand on a assimilé les termes techniques. Vous ne les connaissez pas ? Pas de problème, on est là !\r\n\r\nEn partant d’une application certes mignonne mais plutôt statique, nous allons voir ensemble et en direct sur quels éléments jouer pour donner vie à vos écrans.\r\n\r\nNotre objectif : que vous soyez à l’aise et que vous deveniez moteur dans la conception artistique du projet en proposant des animations simples et surtout peu coûteuses.\r\nPas besoin d’être un·e grand·e créatif·ve pour réaliser des applications chatoyantes !",
      "start": "2023-04-28T15:40:00",
      "end": "2023-04-28T16:25:00",
      "speakerIds": [
        "33443e15-f66d-4f8a-848e-31da9db7ef68",
        "2e99f60c-b3db-48d0-a155-e50064d67d36"
      ],
      "roomId": "31081"
    },
    {
      "id": "29093d9e-5c35-4ade-8c77-26f43f84487e",
      "title": "Break",
      "description": null,
      "start": "2023-04-28T16:25:00",
      "end": "2023-04-28T16:40:00",
      "speakerIds": [],
      "roomId": "31079"
    },
    {
      "id": "461149",
      "title": "Defensive Programming: The Best Software Development Methodology Ever Invented",
      "description": "Software practitioner methodology process organization experts and consultants Romain Guy and Chet Haase will present their latest idea as fact in this probably helpful and certainly billable session on defensive programming. Come. Sit. Watch. Learn (optional).",
      "start": "2023-04-28T16:40:00",
      "end": "2023-04-28T17:15:00",
      "speakerIds": [
        "05fa719f-1528-43ef-adf9-eca92f383262",
        "152f613f-841b-407d-9a65-3703ec2dfae2"
      ],
      "roomId": "31079"
    },
    {
      "id": "9161e94d-fbac-44a7-826b-03b3ffea7a15",
      "title": "Closing",
      "description": null,
      "start": "2023-04-28T17:15:00",
      "end": "2023-04-28T17:25:00",
      "speakerIds": [],
      "roomId": "31079"
    }
  ],
  "speakers": [
    {
      "id": "791d1128-88d2-4f3f-9917-9e4c1f1ea961",
      "name": "Adrien Couque",
      "tagline": "Engineer @Google"
    },
    {
      "id": "a82de654-53d7-4c16-989a-5efddf36983e",
      "name": "Akshay Chordiya",
      "tagline": "Android Developer @ Tinder | Public Speaker | Kotlin Lover | Co-Author of Kotlin Blueprints"
    },
    {
      "id": "e79f9a2d-dd0a-4e40-bd83-57abdcc07147",
      "name": "Alan Chiu",
      "tagline": "Buf, Software Engineer. Ex-Lyft."
    },
    {
      "id": "c73c2377-026f-4b6a-b1f7-91a536c33c67",
      "name": "Aleksandr Denisov",
      "tagline": "EPAM Systems, Chief Software Engineer, Flutter and Dart GDE"
    },
    {
      "id": "ae702dc9-e083-4643-b977-77b1f10cd26f",
      "name": "Anthony Stéphan Guilloteau",
      "tagline": "Freelance, founder of AS Mobile Development, Senior Developer for TAG Heuer"
    },
    {
      "id": "33443e15-f66d-4f8a-848e-31da9db7ef68",
      "name": "Antoine Robiez",
      "tagline": "Mobile Tech Lead @ Worldline"
    },
    {
      "id": "10659767-356c-4cd5-ba9c-12cec7a3ce79",
      "name": "Ash Davies",
      "tagline": "Senior Android Developer @ Snapp Mobile GmbH"
    },
    {
      "id": "2e99f60c-b3db-48d0-a155-e50064d67d36",
      "name": "Baptiste Carlier",
      "tagline": "Android Tech Lead @Decathlon"
    },
    {
      "id": "5f8860b3-e669-4717-91bf-ddceb872fd55",
      "name": "Benjamin Kadel",
      "tagline": "Senior Android Developer at Babbel"
    },
    {
      "id": "449b4215-55cc-444f-8ff4-b0c434a96019",
      "name": "Benoit Quenaudon",
      "tagline": "Cash App"
    },
    {
      "id": "2bc1e95f-1243-4ad0-8a11-75541fee10e0",
      "name": "Carlos Mota",
      "tagline": "Lead Software Engineer at Avancee Software"
    },
    {
      "id": "a20010e8-b898-465f-84c8-69d93ae46194",
      "name": "Cécile Dreyfus",
      "tagline": "MWM - Android developer"
    },
    {
      "id": "05fa719f-1528-43ef-adf9-eca92f383262",
      "name": "Chet Haase",
      "tagline": "Graphics Engineer"
    },
    {
      "id": "4d3a31b1-61e5-4a26-9ca3-c9f30e3eaa08",
      "name": "Danny Preussler",
      "tagline": "Android Lead @ Soundcloud"
    },
    {
      "id": "edfe420a-8175-4064-9f50-b77a64358dd6",
      "name": "David Silvera",
      "tagline": "Lead Android developer at WeMoms"
    },
    {
      "id": "944b39a5-752a-40e4-aa2b-dcc8e0f6da38",
      "name": "Deema AlShamaa",
      "tagline": "Software Engineer"
    },
    {
      "id": "b88bee58-a4e3-4a47-be4d-85c9421457cc",
      "name": "Edouard Marquez",
      "tagline": "Android & Flutter Developer"
    },
    {
      "id": "7c888e22-f254-4e04-aa56-1853ab18c000",
      "name": "Elaine Dias Batista",
      "tagline": "Team Leader at SFEIR"
    },
    {
      "id": "2f606e32-997a-4b74-8420-76a47e7d66a3",
      "name": "Enrique Lopez Manas",
      "tagline": "Google Developer Expert"
    },
    {
      "id": "79823093-1b16-4a2b-b0a9-ea4cd25b92f5",
      "name": "Erik Hellman",
      "tagline": "Severely colourblind, coffee addicted, mistake driven developer."
    },
    {
      "id": "878ec0bb-f4d7-4b83-a9af-ff6e359a35dc",
      "name": "Etienne Caron",
      "tagline": "Freelance Software Developer / Consultant"
    },
    {
      "id": "9f35aab3-8baf-4a74-97a0-735dd9a2479f",
      "name": "Eyal Lezmy",
      "tagline": "Android Lead @ TAG Heuer"
    },
    {
      "id": "0b1323da-2946-49de-be5c-e54d44e12325",
      "name": "Fabien Devos",
      "tagline": "Founder at Wolfia"
    },
    {
      "id": "5f7faf69-dd61-4ad6-b6d8-0173cae292d8",
      "name": "Fatih Giriş",
      "tagline": "Android Lead @DNB"
    },
    {
      "id": "f63fcbea-0846-4b5e-b174-e1e9a5359964",
      "name": "Florent Blot",
      "tagline": "Android Developer @ Geev"
    },
    {
      "id": "8f01dc41-f26d-41d9-a12d-1801e80795cf",
      "name": "François Légaré",
      "tagline": "Innovation service lab lead"
    },
    {
      "id": "23c58f10-a1d1-4c3d-aa8c-caed84503b97",
      "name": "Frédéric Torcheux",
      "tagline": "MWM - Android developer"
    },
    {
      "id": "6520ad1e-8c4e-45c1-b34d-91ca73db27fe",
      "name": "Gerard Paligot",
      "tagline": "Decathlon, Mobile Staff Engineer"
    },
    {
      "id": "3d34325b-8080-415c-9324-b06d036c5cab",
      "name": "Guillaume Bernos",
      "tagline": "Lead Developer FlutterFire"
    },
    {
      "id": "3ff1f933-847b-4e0d-8e01-c2ca21bbab5d",
      "name": "Hadi Hariri",
      "tagline": "Never believed in elevator pitches"
    },
    {
      "id": "60549250-148e-46a0-9868-f5d31b5f7499",
      "name": "Hugo Gresse",
      "tagline": "Mobile developer at Pl@ntNet"
    },
    {
      "id": "d74d249a-ce9e-4887-93a0-fa19d73a501d",
      "name": "Jean-Baptiste Vincey",
      "tagline": "Android developer & tech expert @Deezer"
    },
    {
      "id": "b3770b77-c9c8-454d-8b7a-045ca1d66b7b",
      "name": "Jeroen Mols",
      "tagline": "Software Developer at Plaid and GDE"
    },
    {
      "id": "0392772c-28d4-47f6-bd39-47d743fb4a81",
      "name": "John O'Reilly",
      "tagline": "Android Software Engineer @ Neat"
    },
    {
      "id": "13e3361f-310d-4d75-a593-bb3acfee08a7",
      "name": "Jonathan Mercandalli",
      "tagline": "Android Lead at MWM"
    },
    {
      "id": "05385600-cf94-4333-afb3-0ebb5f9d0269",
      "name": "Jordan Dahnoun",
      "tagline": "Mobile Engineering Manager at JobTeaser"
    },
    {
      "id": "8e90a4dc-33fc-4000-9bcb-802e45b50d87",
      "name": "Julie Gléonnec",
      "tagline": "Android developer @Deezer"
    },
    {
      "id": "462e6b97-01f9-44b1-864c-9d85bedf911b",
      "name": "Julien Salvi",
      "tagline": "Lead Android Engineer @ Aircall"
    },
    {
      "id": "7659a5f9-d376-4ddb-aa96-892b34f40c23",
      "name": "Kelian Clerc",
      "tagline": "Android Software Engineer at Spendesk"
    },
    {
      "id": "c35f2359-2c5c-4b88-a4bc-024a6c025ce4",
      "name": "Kinnera Priya Putti",
      "tagline": "Android developer at ioki"
    },
    {
      "id": "6a7c1f8a-784d-46be-8840-9cf519c4bc78",
      "name": "Lena Stepanova",
      "tagline": "Mobile Developer"
    },
    {
      "id": "7c1cede6-5f59-46bb-ad1e-22b63758dae7",
      "name": "Louis CAD",
      "tagline": "Amande - Founder"
    },
    {
      "id": "bd3e3257-9d05-4f72-9225-50908473778d",
      "name": "Lucas Klegen",
      "tagline": "Manager of Engineering Operations, Wildlife Studios"
    },
    {
      "id": "4e52cb59-2074-4f77-ad95-1f7c36f3bb28",
      "name": "Mackenzie Jackson",
      "tagline": "Developer advocate - Security fanatic "
    },
    {
      "id": "2313d8eb-7d6e-444d-8e8d-4d223f896ce8",
      "name": "Maia Grotepass",
      "tagline": "Staff Engineer: Android principal at Luno"
    },
    {
      "id": "424072c4-ac7b-45e0-9d63-34903356b74c",
      "name": "Marc Picone",
      "tagline": "Android software engineer at MWM"
    },
    {
      "id": "aeddc24f-0e47-4934-ad76-2de7a9dc9fac",
      "name": "Marco Gomiero",
      "tagline": "Senior Android Engineer @ TIER"
    },
    {
      "id": "1fcef224-ed23-4d8d-8e07-4855817796fd",
      "name": "Mark Villacampa",
      "tagline": "SDK Developer @ RevenueCat"
    },
    {
      "id": "56fda597-4927-4d25-9a80-4795d15ef080",
      "name": "Martin Bonnin",
      "tagline": "Mobile Engineer at ApolloGraphQL"
    },
    {
      "id": "12052406-2d03-4184-95a1-1098d88b9ce8",
      "name": "Merab Tato Kutalia",
      "tagline": "GDE for Android | GDG Tbilisi Organizer"
    },
    {
      "id": "ca3e1da2-cfce-4823-8e14-a886f2483c2c",
      "name": "Morad Azzouzi",
      "tagline": "Android Developer at LeBonCoin"
    },
    {
      "id": "fa6ac12a-6cbe-4dd0-8ee0-3d05ddbc2262",
      "name": "Nicolas Rivière",
      "tagline": "Worldline. Mobile developer, lead dev"
    },
    {
      "id": "3192eb25-047c-4d7e-874a-53206c185074",
      "name": "Orel Zion",
      "tagline": "Viz.ai Sr. Android Developer"
    },
    {
      "id": "62216efe-dd8b-4d8b-9800-1d51b57c4001",
      "name": "Pamela Hill",
      "tagline": "Developer Advocate at JetBrains"
    },
    {
      "id": "97bc557b-01db-4ffc-813c-2c4c1a99500c",
      "name": "Pierluigi Rufo",
      "tagline": "Design Lead at Snapp Mobile"
    },
    {
      "id": "b6dc4b56-ca5d-4e55-8a57-e37f6e6d6af0",
      "name": "Piotr Prus",
      "tagline": "Android developer"
    },
    {
      "id": "4674e36f-50f8-4ffb-a486-679d730c759e",
      "name": "Renaud Mathieu",
      "tagline": "Engineering Manager @ Proton, privacy by default"
    },
    {
      "id": "85dc1d24-7fae-4f37-93f7-051b38f8a74d",
      "name": "Romain Bouchaud",
      "tagline": "Founder of NiamorDev"
    },
    {
      "id": "152f613f-841b-407d-9a65-3703ec2dfae2",
      "name": "Romain Guy",
      "tagline": "Android Toolkit"
    },
    {
      "id": "22ac76a5-35b4-478c-a2c6-f7b8a4169928",
      "name": "Romain Rivollier",
      "tagline": "Staff Engineer at Jobteaser"
    },
    {
      "id": "9a7f5add-ce7a-49a3-ab3d-f3c4484453e8",
      "name": "Sinan Kozak",
      "tagline": "Android Staff Engineer - Delivery Hero"
    },
    {
      "id": "f8c30c09-8132-4ac8-91a5-9e7b293063a4",
      "name": "Thomas Ezan",
      "tagline": "Android Developer Relations @Google"
    },
    {
      "id": "9860a793-5622-47ae-83bc-61d1e9c0fa0e",
      "name": "Valentin Pertuisot",
      "tagline": "iOS Team lead at Spendesk"
    },
    {
      "id": "bf58d77f-fad3-49b7-a6b3-82b5f46e5549",
      "name": "Xavier F. Gouchet",
      "tagline": "Senior Software Engineer at Datadog"
    },
    {
      "id": "53bb8035-14c0-479a-9c9d-cc7c9b50c6ff",
      "name": "Yassine Benabbas",
      "tagline": "Worldline. Mobile developer,  lead  dev"
    },
    {
      "id": "1ee57fa9-790a-4a61-a980-6ef301818aea",
      "name": "Zhenlei Ji",
      "tagline": "Android Engineer • Script Addicted • Origami Enthusiast"
    },
    {
      "id": "a733fc42-dcb9-4107-9675-70335f2889e9",
      "name": "🍷Pierre-Yves Ricau",
      "tagline": "Android Plumber"
    }
  ],
  "rooms": [
    {
      "id": "31079",
      "name": "Salle Mœbius"
    },
    {
      "id": "31080",
      "name": "Salle Blin"
    },
    {
      "id": "31081",
      "name": "Salle 2.02"
    },
    {
      "id": "33634",
      "name": "Salle 2.04"
    },
    {
      "id": "33635",
      "name": "Office Hours"
    }
  ]
}